In [1]:
#Import all the required Libraties
import numpy as np
import pandas as pd
import datetime as dt
import matplotlib.pyplot as plt
import seaborn as sns

1. Defining Problem Statement and
Analysing basic metrics.
We will now analyse the data and generate insights that could help Netflix in deciding which
type of shows/movies to produce and how they can grow the business in different countries
and best week to release tv-shows and movie. and find the best month to release tv-show and
movie.

In [3]:

#Read CSV File
df=pd.read_csv('Netflix.csv')

2. Observations on the shape of data, data
types of all the attributes, conversion of
categorical attributes to 'category' (If
required), missing value detection, statistical
summary.

In [4]:
#shape of data
df.shape

(8807, 12)

In [5]:
# Data type of all the attributes.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [18]:
#Missing Value Count
for col in df.columns:
    print("Missing value count in "+col+" :- "+str(len(df[pd.isna(df[col])])))

Missing value count in show_id :- 0
Missing value count in type :- 0
Missing value count in title :- 0
Missing value count in director :- 2634
Missing value count in cast :- 825
Missing value count in country :- 831
Missing value count in date_added :- 10
Missing value count in release_year :- 0
Missing value count in rating :- 4
Missing value count in duration :- 3
Missing value count in listed_in :- 0
Missing value count in description :- 0

In [19]:
#statistical summary 
df.describe()

       release_year
count   8807.000000
mean    2014.180198
std        8.819312
min     1925.000000
25%     2013.000000
50%     2017.000000
75%     2019.000000
max     2021.000000

In [ ]:

#statistical summary of object
df.describe(include=object)

,show_id,type,title,director,cast,country,date_added,rating,duration,listed_in,description
count,8807,8807,8807,6173,7982,7976,8797,8803,8804,8807,8807
unique,8807,2,8807,4528,7692,748,1767,17,220,514,8775
top,s8807,Movie,Zubaan,Rajiv Chilaka,David Attenborough,United States,"January 1, 2020",TV-MA,1 Season,"Dramas, International Movies","Paranormal activity at a lush, abandoned prope..."
freq,1,6131,1,19,19,2818,109,3207,1793,362,4